IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/ECC_AGG_R5SS1_CORE0_ECC_AGG_R5SS1_CORE0.xml
	<register id="ECC_AGG_R5SS1_CORE0_DED_EOI_REG" acronym="ECC_AGG_R5SS1_CORE0_DED_EOI_REG" offset="0x13C" width="0" description="">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="EOI Register" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_R5SS1_CORE0_DED_STATUS_REG0" acronym="ECC_AGG_R5SS1_CORE0_DED_STATUS_REG0" offset="0x140" width="32" description="">
		<bitfield id="CPU0_KS_VIM_RAMECC_PEND" width="1" begin="27" end="27" resetval="0x0" description="Interrupt Pending Status for cpu0_ks_vim_ramecc_pend" range="27" rwaccess="RW"/> 
		<bitfield id="B1TCM0_BANK1_PEND" width="1" begin="26" end="26" resetval="0x0" description="Interrupt Pending Status for b1tcm0_bank1_pend" range="26" rwaccess="RW"/> 
		<bitfield id="B1TCM0_BANK0_PEND" width="1" begin="25" end="25" resetval="0x0" description="Interrupt Pending Status for b1tcm0_bank0_pend" range="25" rwaccess="RW"/> 
		<bitfield id="B0TCM0_BANK1_PEND" width="1" begin="24" end="24" resetval="0x0" description="Interrupt Pending Status for b0tcm0_bank1_pend" range="24" rwaccess="RW"/> 
		<bitfield id="B0TCM0_BANK0_PEND" width="1" begin="23" end="23" resetval="0x0" description="Interrupt Pending Status for b0tcm0_bank0_pend" range="23" rwaccess="RW"/> 
		<bitfield id="ATCM0_BANK1_PEND" width="1" begin="22" end="22" resetval="0x0" description="Interrupt Pending Status for atcm0_bank1_pend" range="22" rwaccess="RW"/> 
		<bitfield id="ATCM0_BANK0_PEND" width="1" begin="21" end="21" resetval="0x0" description="Interrupt Pending Status for atcm0_bank0_pend" range="21" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM7_PEND" width="1" begin="20" end="20" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram7_pend" range="20" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM6_PEND" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram6_pend" range="19" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM5_PEND" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram5_pend" range="18" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM4_PEND" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram4_pend" range="17" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM3_PEND" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram3_pend" range="16" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM2_PEND" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram2_pend" range="15" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM1_PEND" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram1_pend" range="14" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM0_PEND" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram0_pend" range="13" rwaccess="RW"/> 
		<bitfield id="CPU0_DDIRTY_RAM_PEND" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Pending Status for cpu0_ddirty_ram_pend" range="12" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM3_PEND" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Pending Status for cpu0_dtag_ram3_pend" range="11" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM2_PEND" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Pending Status for cpu0_dtag_ram2_pend" range="10" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM1_PEND" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Pending Status for cpu0_dtag_ram1_pend" range="9" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM0_PEND" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Pending Status for cpu0_dtag_ram0_pend" range="8" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK3_PEND" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Pending Status for cpu0_idata_bank3_pend" range="7" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK2_PEND" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Pending Status for cpu0_idata_bank2_pend" range="6" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK1_PEND" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Pending Status for cpu0_idata_bank1_pend" range="5" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK0_PEND" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Pending Status for cpu0_idata_bank0_pend" range="4" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM3_PEND" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Pending Status for cpu0_itag_ram3_pend" range="3" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM2_PEND" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Pending Status for cpu0_itag_ram2_pend" range="2" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM1_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for cpu0_itag_ram1_pend" range="1" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM0_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for cpu0_itag_ram0_pend" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_R5SS1_CORE0_DED_ENABLE_SET_REG0" acronym="ECC_AGG_R5SS1_CORE0_DED_ENABLE_SET_REG0" offset="0x180" width="32" description="">
		<bitfield id="CPU0_KS_VIM_RAMECC_ENABLE_SET" width="1" begin="27" end="27" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ks_vim_ramecc_pend" range="27" rwaccess="RW"/> 
		<bitfield id="B1TCM0_BANK1_ENABLE_SET" width="1" begin="26" end="26" resetval="0x0" description="Interrupt Enable Set Register for b1tcm0_bank1_pend" range="26" rwaccess="RW"/> 
		<bitfield id="B1TCM0_BANK0_ENABLE_SET" width="1" begin="25" end="25" resetval="0x0" description="Interrupt Enable Set Register for b1tcm0_bank0_pend" range="25" rwaccess="RW"/> 
		<bitfield id="B0TCM0_BANK1_ENABLE_SET" width="1" begin="24" end="24" resetval="0x0" description="Interrupt Enable Set Register for b0tcm0_bank1_pend" range="24" rwaccess="RW"/> 
		<bitfield id="B0TCM0_BANK0_ENABLE_SET" width="1" begin="23" end="23" resetval="0x0" description="Interrupt Enable Set Register for b0tcm0_bank0_pend" range="23" rwaccess="RW"/> 
		<bitfield id="ATCM0_BANK1_ENABLE_SET" width="1" begin="22" end="22" resetval="0x0" description="Interrupt Enable Set Register for atcm0_bank1_pend" range="22" rwaccess="RW"/> 
		<bitfield id="ATCM0_BANK0_ENABLE_SET" width="1" begin="21" end="21" resetval="0x0" description="Interrupt Enable Set Register for atcm0_bank0_pend" range="21" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM7_ENABLE_SET" width="1" begin="20" end="20" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram7_pend" range="20" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM6_ENABLE_SET" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram6_pend" range="19" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM5_ENABLE_SET" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram5_pend" range="18" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM4_ENABLE_SET" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram4_pend" range="17" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM3_ENABLE_SET" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram3_pend" range="16" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM2_ENABLE_SET" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram2_pend" range="15" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM1_ENABLE_SET" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram1_pend" range="14" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM0_ENABLE_SET" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram0_pend" range="13" rwaccess="RW"/> 
		<bitfield id="CPU0_DDIRTY_RAM_ENABLE_SET" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddirty_ram_pend" range="12" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM3_ENABLE_SET" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Enable Set Register for cpu0_dtag_ram3_pend" range="11" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM2_ENABLE_SET" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Enable Set Register for cpu0_dtag_ram2_pend" range="10" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM1_ENABLE_SET" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Enable Set Register for cpu0_dtag_ram1_pend" range="9" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM0_ENABLE_SET" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Set Register for cpu0_dtag_ram0_pend" range="8" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK3_ENABLE_SET" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Set Register for cpu0_idata_bank3_pend" range="7" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK2_ENABLE_SET" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Set Register for cpu0_idata_bank2_pend" range="6" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK1_ENABLE_SET" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Set Register for cpu0_idata_bank1_pend" range="5" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK0_ENABLE_SET" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set Register for cpu0_idata_bank0_pend" range="4" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM3_ENABLE_SET" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set Register for cpu0_itag_ram3_pend" range="3" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM2_ENABLE_SET" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set Register for cpu0_itag_ram2_pend" range="2" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM1_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for cpu0_itag_ram1_pend" range="1" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM0_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for cpu0_itag_ram0_pend" range="0" rwaccess="RW"/>
	</register>
